tap "adoptopenjdk/openjdk"
tap "candid82/brew"
tap "clementtsang/bottom"
tap "cmacrae/formulae"
tap "d12frosted/emacs-plus"
tap "dwarvesf/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "knazarov/qemu-virgl"
tap "koekeishiya/formulae"
tap "railwaycat/emacsmacport"
tap "universal-ctags/universal-ctags"
tap "wpscanteam/tap"
tap "yt-dlp/taps"
tap "zegervdv/zathura"
brew "ack"
brew "xz"
brew "python@3.9"
brew "glib"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "aircrack-ng"
brew "libyaml"
brew "ansible"
brew "libssh2"
brew "aria2"
brew "automake"
brew "bat"
brew "bfg"
brew "binutils"
brew "gmp"
brew "libraqm"
brew "numpy"
brew "p7zip"
brew "pillow"
brew "binwalk"
brew "bpython"
brew "bpytop"
brew "coreutils"
brew "libtool"
brew "p11-kit"
brew "gnutls"
brew "nghttp2"
brew "cask"
brew "cifer"
brew "cjson"
brew "cmake", link: false
brew "cmatrix"
brew "curl"
brew "dex2jar"
brew "dns2tcp"
brew "docker", link: false
brew "docutils"
brew "dust"
brew "entr"
brew "exa"
brew "exiftool"
brew "fcrackzip"
brew "fd", link: false
brew "libass"
brew "srt"
brew "ffmpeg"
brew "fftw"
brew "findutils"
brew "fish"
brew "portaudio"
brew "fluid-synth"
brew "foremost"
brew "freetds"
brew "fzf"
brew "gcalcli"
brew "gdb"
brew "ghq"
brew "git"
brew "git-lfs", link: false
brew "glib-networking"
brew "libusb"
brew "gnupg"
brew "go"
brew "gobuster"
brew "netpbm", link: false
brew "graphviz"
brew "grep"
brew "gstreamer"
brew "gst-plugins-base"
brew "gst-libav"
brew "gst-plugins-bad"
brew "gtk+3"
brew "gst-plugins-good"
brew "gst-plugins-ugly"
brew "gtk-mac-integration"
brew "gtksourceview4"
brew "hashpump"
brew "htop"
brew "hugo"
brew "libssh"
brew "hydra", link: false
brew "ical-buddy"
brew "libheif"
brew "imagemagick"
brew "john"
brew "jq"
brew "json-glib"
brew "knock"
brew "lazygit"
brew "ldns"
brew "ledger"
brew "libfido2"
brew "libslirp"
brew "libsoup"
brew "ruby"
brew "libstfl"
brew "libuv"
brew "libvirt"
brew "llvm"
brew "lolcat"
brew "lua"
brew "luajit", args: ["HEAD"]
brew "luarocks"
brew "lynx"
brew "m-cli"
brew "mas"
brew "ninja"
brew "meson"
brew "moreutils"
brew "mpc", link: false
brew "mpd"
brew "vapoursynth"
brew "yt-dlp"
brew "mpv"
brew "ncmpcpp"
brew "neofetch"
brew "neovim", args: ["HEAD"], link: false
brew "netcat"
brew "newsboat"
brew "nikto"
brew "nmap"
brew "node", link: false
brew "ocp"
brew "openssh"
brew "openvpn"
brew "pandoc", link: false
brew "peco"
brew "php"
brew "pigz"
brew "pngcheck"
brew "pngpaste"
brew "qt"
brew "poppler"
brew "pulseaudio", restart_service: true
brew "pup"
brew "pv"
brew "qemu"
brew "ranger"
brew "rename"
brew "ripgrep"
brew "rlwrap"
brew "rsstail"
brew "rustscan"
brew "screen"
brew "socat"
brew "sphinx-doc"
brew "usbredir"
brew "spice-gtk"
brew "sqlmap"
brew "ssh-copy-id"
brew "stow"
brew "task"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "telnet"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tldr", link: false
brew "tmux"
brew "tree"
brew "tty-clock"
brew "ucspi-tcp"
brew "util-linux"
brew "vala"
brew "vbindiff"
brew "vte3"
brew "wget"
brew "xclip"
brew "xxh"
brew "yarn"
brew "youtube-dl"
brew "zopfli"
brew "clementtsang/bottom/bottom"
brew "cmacrae/formulae/spacebar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-emacs-sexy-icon", "with-no-title-bars", "with-starter"], link: false
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "wpscanteam/tap/wpscan"
brew "zegervdv/zathura/girara", args: ["HEAD"]
brew "zegervdv/zathura/zathura", args: ["HEAD"]
brew "zegervdv/zathura/zathura-pdf-poppler"
cask "alacritty"
cask "alfred"
cask "background-music"
cask "betterdiscord-installer"
cask "bettertouchtool"
cask "discord"
cask "dmenu-mac"
cask "dozer"
cask "font-fira-code"
cask "google-chrome"
cask "karabiner-elements"
cask "metasploit"
cask "ngrok"
cask "notion"
cask "obs"
cask "omnidisksweeper"
cask "qbittorrent"
cask "stats"
cask "syncplay"
cask "tickeys"
cask "virtualbox"
cask "wireshark"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Encrypto", id: 935235287
mas "Flow", id: 1423210932
mas "GoodNotes", id: 1444383602
mas "Greenshot", id: 1103915944
mas "Microsoft OneNote", id: 784801555
mas "NordVPN", id: 905953485
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 1147396723
