tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "riscv/riscv"
tap "teamookla/speedtest"
brew "cairo"
brew "libtiff"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "giflib"
brew "jpeg-xl"
brew "aspell"
brew "at-spi2-core"
brew "boost"
brew "avrdude"
brew "bandwhich"
brew "bottom"
brew "unbound"
brew "gnutls"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "tesseract"
brew "ffmpeg"
brew "gcc"
brew "numpy"
brew "cmake"
brew "coreutils"
brew "curl"
brew "dust"
brew "enchant"
brew "entr"
brew "fd"
brew "fileicon"
brew "fish"
brew "fluid-synth"
brew "fzf"
brew "gcalcli"
brew "gdb"
brew "gh"
brew "ghostscript"
brew "ghq"
brew "git"
brew "glib-networking"
brew "libassuan"
brew "gnupg"
brew "gpgme"
brew "gmime"
brew "gtk+3"
brew "libxml2"
brew "gnumeric"
brew "grep"
brew "gsasl"
brew "gtk4"
brew "guile"
brew "hugo"
brew "libheif"
brew "imagemagick"
brew "isync"
brew "jpeg"
brew "jq"
brew "libffi"
brew "libgccjit"
brew "libiconv"
brew "libplacebo"
brew "mailutils"
brew "mas"
brew "meson"
brew "mpc"
brew "mpd", restart_service: true
brew "yt-dlp"
brew "mpv"
brew "neofetch"
brew "neovim"
brew "node"
brew "open-mpi"
brew "openjdk@17"
brew "openssl@1.1"
brew "pandoc"
brew "pillow"
brew "pngpaste"
brew "poppler"
brew "pygobject3"
brew "python@3.11"
brew "qemu"
brew "ranger"
brew "ripgrep"
brew "rust-analyzer"
brew "rustup-init"
brew "sevenzip"
brew "starship"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
brew "x86_64-elf-gcc"
brew "x86_64-elf-gdb"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-imagemagick", "with-mailutils", "with-native-comp"]
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "qmk/qmk/qmk"
brew "riscv/riscv/riscv-tools"
brew "teamookla/speedtest/speedtest"
cask "alacritty"
cask "alfred"
cask "chromium"
cask "dropbox"
cask "figma"
cask "firefox"
cask "gimp"
cask "iina"
cask "karabiner-elements"
cask "mactex"
cask "qbittorrent"
cask "qmk-toolbox"
cask "raspberry-pi-imager"
cask "upscayl"
cask "vlc"
cask "vmware-fusion"
cask "zoom"
mas "GarageBand", id: 682658836
mas "Spark", id: 1176895641
mas "Xnip", id: 1221250572
