tap "candid82/brew"
tap "clementtsang/bottom"
tap "cmacrae/formulae"
tap "d12frosted/emacs-plus"
tap "dwarvesf/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "railwaycat/emacsmacport"
tap "universal-ctags/universal-ctags"
tap "zegervdv/zathura"
brew "ack"
brew "sqlite"
brew "xz"
brew "harfbuzz"
brew "pango"
brew "adwaita-icon-theme"
brew "aircrack-ng"
brew "automake"
brew "bat"
brew "bfg"
brew "mas"
brew "binutils"
brew "gmp"
brew "numpy"
brew "p7zip"
brew "binwalk"
brew "bpython"
brew "bpytop"
brew "coreutils"
brew "libtool"
brew "cask"
brew "cifer"
brew "cjson"
brew "cmake"
brew "libssh2"
brew "curl"
brew "dex2jar"
brew "dns2tcp"
brew "docker"
brew "dust"
brew "exa"
brew "exiftool"
brew "fcrackzip"
brew "fd"
brew "libass"
brew "ffmpeg"
brew "fftw"
brew "findutils"
brew "ncurses"
brew "fish"
brew "portaudio"
brew "fluid-synth"
brew "foremost"
brew "freetds"
brew "fzf"
brew "gcalcli"
brew "gdb"
brew "ghostscript", link: false
brew "ghq"
brew "git"
brew "git-lfs"
brew "glib-networking"
brew "gnupg"
brew "go"
brew "gobuster"
brew "netpbm"
brew "graphviz"
brew "grep"
brew "gtk+3"
brew "vala"
brew "libsoup"
brew "gtk-mac-integration"
brew "gtksourceview4"
brew "hashpump"
brew "htop"
brew "libssh"
brew "hydra"
brew "ical-buddy"
brew "imagemagick"
brew "john"
brew "jq"
brew "json-glib"
brew "knock"
brew "lazygit"
brew "ledger"
brew "libslirp"
brew "libyaml"
brew "ruby"
brew "libstfl"
brew "libuv"
brew "libvirt"
brew "llvm"
brew "lolcat"
brew "lua"
brew "luajit", args: ["HEAD"]
brew "lynx"
brew "moreutils"
brew "mpc"
brew "mpd"
brew "youtube-dl"
brew "mpv"
brew "ncmpcpp"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "netcat"
brew "newsboat"
brew "nmap"
brew "node", link: false
brew "ocp"
brew "openssh"
brew "openvpn"
brew "pandoc"
brew "peco"
brew "php"
brew "pigz"
brew "pngcheck"
brew "qt"
brew "poppler"
brew "pulseaudio", restart_service: true
brew "pv"
brew "qemu"
brew "ranger"
brew "rename"
brew "ripgrep"
brew "rlwrap"
brew "screen"
brew "socat"
brew "sphinx-doc"
brew "usbredir"
brew "spice-gtk"
brew "sqlmap"
brew "ssh-copy-id"
brew "stow"
brew "task"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "telnet"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "tty-clock"
brew "ucspi-tcp"
brew "vbindiff"
brew "vte3"
brew "wget"
brew "xclip"
brew "xxh"
brew "yarn"
brew "zopfli"
brew "clementtsang/bottom/bottom"
brew "cmacrae/formulae/spacebar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-no-title-bars"]
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "zegervdv/zathura/girara", args: ["HEAD"]
brew "zegervdv/zathura/zathura", args: ["HEAD"]
brew "zegervdv/zathura/zathura-pdf-poppler"
cask "alacritty"
cask "google-chrome"
cask "background-music"
cask "font-fira-code"
cask "karabiner-elements"
cask "tickeys"
cask "notion"
cask "alfred"
cask "betterdiscord-installer"
cask "stats"
cask "bettertouchtool"
cask "dozer"
cask "omnidisksweeper"
cask "dropbox"
mas "GoodNotes 5", id: 1444383602
mas "Microsoft OneNote", id: 784801555
mas "Spark – Email App by Readdle", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Encrypto: Secure Your Files", id: 935235287
mas "Speedtest by Ookla", id: 1153157709
